<?php

require 'functions.php';

$data = [
    "Пароль: 1899<br />\nСпишется 100,51р.<br />\nПеревод на счет 410013763018203" => ['1899', 10051, '410013763018203'],
    "Пароль: 1899<br />\nСпишется 100,51Р.<br />\nПеревод на счет 410013763018203" => ['1899', 10051, '410013763018203'],
    "Пароль: 1899<br />\nСпишется 100,51Я.<br />\nПеревод на счет 410013763018203" => null,

    "Пароль: 1899<br />\nСпишется 100,07р.<br />\nПеревод на счет 410013763018203" => ['1899', 10007, '410013763018203'],
    "Пароль: 1899<br />\nСпишется 100,40р.<br />\nПеревод на счет 410013763018203" => ['1899', 10040, '410013763018203'],
    "Пароль: 1899<br />\nСпишется 100,4р.<br />\nПеревод на счет 410013763018203" => ['1899', 10040, '410013763018203'],
    "Пароль: 1899<br />\nСпишется 1240р.<br />\nПеревод на счет 410013763018203" => ['1899', 124000, '410013763018203'],
    "Пароль: 1899<br />\nСпишется 1240 р.<br />\nПеревод на счет 410013763018203" => ['1899', 124000, '410013763018203'],
    "Пароль: 1899<br />\nСпишется 1240  р.<br />\nПеревод на счет 410013763018203" => null,

    "Пароль: 1899<br />\nСпишется 140,987 р.<br />\nПер на счет 410013763018203" => null,
    "Пароль: 1899<br />\nСпишется 100.51р.<br />\nПеревод на счет 410013763018203" => ['1899', 10051, '410013763018203'],
    "Пароль: 1899<br />\nСпишется 100.07р.<br />\nПеревод на счет 410013763018203" => ['1899', 10007, '410013763018203'],
    "Пароль: 1899<br />\nСпишется 100.40р.<br />\nПеревод на счет 410013763018203" => ['1899', 10040, '410013763018203'],
    "Пароль: 1899<br />\nСпишется 100.4р.<br />\nПеревод на счет 410013763018203" => ['1899', 10040, '410013763018203'],
    "Пароль: 1899<br />\nСпишется ..100.51р.<br />\nПеревод на счет 410013763018203" => ['1899', 10051, '410013763018203'],
    "Пароль: 1899<br />\nСпишется ..100.07р.<br />\nПеревод на счет 410013763018203" => ['1899', 10007, '410013763018203'],
    "Пароль: 1899<br />\nСпишется ..100.40р.<br />\nПеревод на счет 410013763018203" => ['1899', 10040, '410013763018203'],
    "Пароль: 1899<br />\nСпишется ..100.4р.<br />\nПеревод на счет 410013763018203" => ['1899', 10040, '410013763018203'],
    "Пароль: 1899<br />\nСпишется ..140.987 р.<br />\nПер на счет 410013763018203" => null,

    "Пароль: 1899 пароль 1899<br />\nСпишется 100,51р.<br />\nПеревод на счет 410013763018203" => null,
    "Пароль: 1899<br />\nСпишется 100,51р.Спишется 100,51р.<br />\nПеревод на счет 410013763018203" => null,
    "Пароль: 1899<br />\nСпишется 100,51р.<br />\nПеревод на счет 410013763018203Перевод на счет 410013763018203" => null,

    "Пароль: 012345<br />\nСпишется 100,51р.<br />\nПеревод на счет 410013763018203" => ['012345', 10051, '410013763018203'],
    "Пароль: 0000<br />\nСпишется 100,51р.<br />\nПеревод на счет 410013763018203" => ['0000', 10051, '410013763018203'],
    "Пароль: 12<br />\nСпишется 100,51р.<br />\nПеревод на счет 410013763018203" => null,
    "Пароль: 123<br />\nСпишется 100,51р.<br />\nПеревод на счет 410013763018203" => ['123', 10051, '410013763018203'],
    "Пароль: 12345678<br />\nСпишется 100,51р.<br />\nПеревод на счет 410013763018203" => ['12345678', 10051, '410013763018203'],
    "Пароль: 123456789<br />\nСпишется 100,51р.<br />\nПеревод на счет 410013763018203" => null,
    "Пароль: 12e10<br />\nСпишется 100,51р.<br />\nПеревод на счет 410013763018203" => null,
    "Пароль: 123e10<br />\nСпишется 100,51р.<br />\nПеревод на счет 410013763018203" => ['123', 10051, '410013763018203'],
    "Пароль: ..12.1<br />\nСпишется 100,51р.<br />\nПеревод на счет 410013763018203" => null,

    "Пароль: 1899<br />\nСпишется 0100,51р.<br />\nПеревод на счет 410013763018203" => ['1899', 10051, '410013763018203'],

    "Пароль: 1899<br />\nСпишется 100,51р.<br />\nПеревод на счет 410013763" => null,
    "Пароль: 1899<br />\nСпишется 100,51р.<br />\nПеревод на счет 4100137630" => ['1899', 10051, '4100137630'],
    "Пароль: 1899<br />\nСпишется 100,51р.<br />\nПеревод на счет 41001376309999999999" => ['1899', 10051, '41001376309999999999'],
    "Пароль: 1899<br />\nСпишется 100,51р.<br />\nПеревод на счет 410013763099999999999" => null,
    "Пароль: 1899<br />\nСпишется 100,51р.<br />\nПеревод на счет 410013e763018203" => null,

    'password - 1899; amount - 100,51 rub; id - 410013763018203' => ['1899', 10051, '410013763018203'],
    'password - 1899; id - 410013763018203; amount - 100,51 rub' => ['1899', 10051, '410013763018203'],
    'amount - 100,51 rub; password - 1899; id - 410013763018203' => ['1899', 10051, '410013763018203'],
    'amount - 100,51 rub; id - 410013763018203; password - 1899;' => ['1899', 10051, '410013763018203'],
    'id - 410013763018203; amount - 100,51 rub; password - 1899;' => ['1899', 10051, '410013763018203'],
    'id - 410013763018203; password - 1899; amount - 100,51 rub' => ['1899', 10051, '410013763018203'],

    '1899 psw, 100,51r - am, 410013763018203 - id' => ['1899', 10051, '410013763018203'],
    '100,51r - am, 410013763018203 - id, 1899 psw;' => ['1899', 10051, '410013763018203'],
    '410013763018203 - id, 100,51r - am, 1899 psw;' => ['1899', 10051, '410013763018203'],
    'p. 1899, a.100,51r, id. 410013763018203' => ['1899', 10051, '410013763018203'],
    'p. 1899, id. 410013763018203, a.100,51r' => ['1899', 10051, '410013763018203'],
    'id. 410013763018203, a.100,51r, p. 1899' => ['1899', 10051, '410013763018203'],
];

$errors = [];

foreach ($data as $text => $expected) {
    $parsed = parse_sms($text);

    if ($parsed !== $expected) {
        $errors[$text] = 'Expected ['. implode(',', $expected ?? ['null']) .
            '] got [' . implode(',', $parsed ?? ['null']) . ']';
    }
}

echo 'Tests: ' . count($data) . "\n";
echo 'Errors: ' . count($errors) . "\n";
foreach ($errors as $text => $error) {
    echo "\ntext: $text\n" . "error: $error\n";
}
